uat_chat/Documents/НарядНаТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>НарядНаТО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РазрешениеНаЗаменуМасла</xr:Item>
				<xr:Item>InformationRegister.уатПрохождениеТО</xr:Item>
				<xr:Item>InformationRegister.РазрешениеНаЗаменуМаслаОтчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяРедакция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбслуживания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Агрегат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыАгрегатовТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Автомобили</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/InformationRegisters/уатПрохождениеТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатПрохождениеТО</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/РазрешениеНаЗаменуМасла.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>РазрешениеНаЗаменуМасла</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>44</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАгрегатовТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Замена</Name>
					<Comment>0 - Долив, 1 - акт, 2 - замена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/РазрешениеНаЗаменуМаслаОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>РазрешениеНаЗаменуМаслаОтчет</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>44</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАгрегатовТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Замена</Name>
					<Comment>0 - Долив, 1 - акт, 2 - замена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/ОтветственныеЛицаОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизации</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/уатМестонахождениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатМестонахождениеТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостояниеТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Enums/ОтветственныеЛицаОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДирЭкспл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлОпер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачОТИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачОТК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачПТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачОК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачОЭ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

uat_chat/Catalogs/уатВидыОбслуживанияТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>уатВидыОбслуживанияТС</Name>
			<Comment>Виды обслуживания ТС (уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбслуживанияТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВПланированииТО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовмещаемыйВО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКФайлуИсточнику</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьВТолькоПоРемЛистам</Name>
					<Comment>Делать  проведение не в заказ-нарядах, а в рем.листах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьВыпискуПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Documents/НарядНаТО/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ  DISTINCT
	                |	НарядНаТОТО.ТС,
	                |	спрВО.ссылка ВидТО,
	                |	Значение(Справочник.уатПараметрыВыработки.ПробегОбщий) ПараметрВыработки,
	                |	CASE WHEN НарядНаТОТО.Начало < ДатаВремя(2000,1,1) THEN НарядНаТОТО.Ссылка.Дата ELSE НарядНаТОТО.Начало END Период
	                |ИЗ
	                |	Документ.НарядНаТО.ТО КАК НарядНаТОТО
					|INNER JOIN Справочник.уатВидыОбслуживанияТС спрВО ON спрВО.ссылка = ВидОбслуживания.Ссылка или спрВО.ссылка = ВидОбслуживания.СовмещаемыйВО
					|WHERE Выполнено и НарядНаТОТО.ССылка =&сс
					|    и спрВО.ПроводитьВТолькоПоРемЛистам = Ложь ";
					Запрос.УстановитьПараметр("сс",Ссылка);
					Тбл = Запрос.Выполнить().Выгрузить();
					
	Рег = Движения.уатПрохождениеТО;
	Рег.Загрузить(Тбл);
	Рег.Записать();
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	НарядНаТОТО.ТС,
	                |	CASE WHEN НарядНаТОТО.Начало < ДатаВремя(2000,1,1) THEN НарядНаТОТО.Ссылка.Дата ELSE НарядНаТОТО.Начало END КАК Период,
	                |	НарядНаТОТО.Агрегат,
	                |	НарядНаТОТО.Ссылка.Номер Номер,
				    |   CASE WHEN НарядНаТОТО.Агрегат = Значение(Справочник.ВидыАгрегатовТС.ПустаяСсылка) THEN 0 ELSE 2 END Замена,
				    |   3 КодВида,
				    |   ""Наряд на ТО"" ВидДок
	                |ИЗ
	                |	Документ.НарядНаТО.ТО КАК НарядНаТОТО
	                |ГДЕ  НарядНаТОТО.Ссылка = &сс";
					Запрос.УстановитьПараметр("сс",Ссылка);
					Тбл = Запрос.Выполнить().Выгрузить();
					
	Рег = Движения.РазрешениеНаЗаменуМасла;
	Рег.Загрузить(Тбл);
	Рег.Записать();
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	НарядНаТОТО.ТС,
	                |	ВЫБОР
	                |		КОГДА НарядНаТОТО.Начало < ДАТАВРЕМЯ(2000, 1, 1)
	                |			ТОГДА НарядНаТОТО.Ссылка.Дата
	                |		ИНАЧЕ НарядНаТОТО.Начало
	                |	КОНЕЦ КАК Период,
	                |	НарядНаТОТО.Агрегат,
	                |	НарядНаТОТО.Ссылка.Номер КАК Номер,
	                |	ВЫБОР
	                |		КОГДА НарядНаТОТО.Агрегат = ЗНАЧЕНИЕ(Справочник.ВидыАгрегатовТС.ПустаяСсылка)
	                |			ТОГДА 0
	                |		ИНАЧЕ 2
	                |	КОНЕЦ КАК Замена,
	                |	3 КАК КодВида,
	                |	""Наряд на ТО"" КАК ВидДок
	                |ИЗ
	                |	Документ.НарядНаТО.ТО КАК НарядНаТОТО
	                |ГДЕ
	                |	НарядНаТОТО.Ссылка = &сс
	                |	И НарядНаТОТО.Выполнено = ИСТИНА";
					Запрос.УстановитьПараметр("сс",Ссылка);
					Тбл = Запрос.Выполнить().Выгрузить();
					
	Рег = Движения.РазрешениеНаЗаменуМаслаОтчет;
	Рег.Загрузить(Тбл);
	Рег.Записать();
	
					
КонецПроцедуры

Функция Данные(СткАгр)
	
	Тбл = Ссылка.ТО.ВыгрузитьКолонки("Выполнено,ТС,Начало");
	Тбл.Колонки.Добавить("ВидОбслуживания");
	СткАгр = Новый Структура;
	АгрСоо = Новый Соответствие;
	
	Выборка = Справочники.ВидыАгрегатовТС.Выбрать(,,,"Код");
	Пока Выборка.Следующий() Цикл
		Если Выборка.РазрешитьВыдачуМасла = Ложь Тогда Продолжить; КонецЕсли;
		Рек = "Р"+СокрЛП(Выборка.Код);
		СткАгр.Вставить(Рек,Выборка.Ссылка);
		АгрСоо.Вставить(Выборка.Ссылка,Рек);
		Тбл.Колонки.Добавить(Рек,Новый ОписаниеТипов("Булево"),СокрлП(Выборка.Наименование));
	КонецЦикла;
	
	Для каждого стр из Ссылка.ТО Цикл
		С = Тбл.Найти(Стр.ТС,"ТС");
		Если С=Неопределено тогда
			С = Тбл.Добавить();
			ЗаполнитьЗначенияСвойств(С,Стр);
		КонеЦЕСЛИ;
		Если ЗначениеЗаполнено(Стр.Агрегат) ТОгда
			С[АгрСоо.Получить(Стр.Агрегат)] = Истина;
		КонеЦЕСЛИ;
	КонецЦиклА;
	
	Для каждого стр из ссылка.Автомобили Цикл
			С = Тбл.Добавить();
			С.Тс = Стр.ТС;
			С.ВидОбслуживания = Стр.Работа;
	КонецЦиклА;
	
    Возврат Тбл;	
	
КонецФункции

Функция СткШапка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НарядНаТО.Организация,
	               |	НарядНаТО.Номер,
	               |	НарядНаТО.Дата,
	               |	ОтвРук.ФизическоеЛицо Рук
	               |ИЗ
	               |	Документ.НарядНаТО КАК НарядНаТО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(&Дт,ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизации.НачПТО)) КАК ОтвРук
	               |		ПО НарядНаТО.Организация = ОтвРук.СтруктурнаяЕдиница
				   |WHERE НарядНаТО.Ссылка = &сс
				   |";
				   Запрос.УстановитьПараметр("Дт",Ссылка.Дата);
				   Запрос.УстановитьПараметр("сс",Ссылка);
				   тбл = запрос.Выполнить().Выгрузить();
				   
				   Стк = Новый Структура("Организация,Номер,Дата,Рук,ДлжРук");
				   ЗаполнитьЗначенияСвойств(Стк,Тбл[0]);
				   
				   С = уатОбщегоНазначенияТиповые.ДанныеФизЛица(Стк.Организация,Тбл[0].Рук,Стк.Дата);
				   Стк.Рук = С.Представление;
				   Стк.длжРук = С.Должность;
				   Стк.Дата = Формат(Стк.дата,"ДФ=dd.MM.yyyy")+" г.";
				   
				   Возврат Стк;
	
КонецФункции


Процедура ПечатьНаряд() Экспорт
	
	Если Не уатОбщегоНазначенияТиповые.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СткШапка = СткШапка();
	СткАгр = Новый Структура;
	Тбл = Данные(СткАгр);
	
	Таб = Новый ТабличныйДокумент;
	Таб.ИмяПараметровПечати = "НарядТО";
	Макет = ПолучитьМакет("Макет");
	
	облШапка = макет.ПолучитьОбласть("Заголовок");
	облШапка.Параметры.Организация = Организация.Наименование;	
	облШапка.Параметры.Заполнить(СткШапка);
	Таб.Вывести(облШапка);
	
	облШапка = макет.ПолучитьОбласть("Шапка|й1");
	облШапка.Параметры.Заполнить(СткШапка);
	Таб.Вывести(облШапка);
	НачОбл = облШапка.ШиринаТаблицы+1;
	Для каждого Эл из сткАгр Цикл
		облШапка = макет.ПолучитьОбласть("Шапка|й2");
		Если СокрлП(Эл.Значение.КраткоеНаименование)="" Тогда
			облШапка.Параметры.Зн = Эл.Значение; 
			//Продолжить;
		ИНаче
			облШапка.Параметры.Зн = СокрлП(Эл.Значение.КраткоеНаименование); 
		КонеЦЕСЛИ;
		Таб.Присоединить(облШапка);
	КонецЦикла;
	Таб.Область(7,НачОбл,7,Таб.ШиринаТаблицы).Объединить();
	облШапка = макет.ПолучитьОбласть("Шапка|й3");
	Таб.Присоединить(облШапка);
	
	облСтр1 = макет.ПолучитьОбласть("Строка|й1");
	облСтр2 = макет.ПолучитьОбласть("Строка|й2");
	облСтр3 = макет.ПолучитьОбласть("Строка|й3");
	
	Ном=0;
	Для каждого Стр из Тбл Цикл
		облСтр1.Параметры.Заполнить(Стр);
		облСтр1.Параметры.ГарНомер = Стр.ТС.ГаражныйНомер;
		облСтр1.Параметры.ГосНомер = Стр.ТС.ГосударственныйНомер;
		Ном=Ном+1;
		облСтр1.Параметры.Ном = Ном;
		
		Таб.Вывести(облСтр1);
		Для каждого Эл из сткАгр Цикл
			//Если СокрлП(Эл.Значение.КраткоеНаименование)="" Тогда
			//    Продолжить;	
			//КонецЕсли;
			Если Стр[Эл.Ключ] Тогда
				облСтр2.Параметры.зн = "Х";
			ИНАче
				облСтр2.Параметры.зн = "";
			КонецЕсли;
			Таб.Присоединить(облСтр2);
		КонецЦикла;
		Таб.Присоединить(облСтр3);
	КонецЦикла;
	
	Таб.Вывести(макет.ПолучитьОбласть("Итог"));
	
	
	Таб.ФиксацияСверху = 8;
	Таб.ФиксацияСлева = 3;
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки=Ложь;
	Таб.ОтображатьСетку = ложь;
	Таб.Показать("Наряд_ТО");
	
КонецПроцедуры

//=======================================

Функция ДанныеГр(тбКол,Стрсвр,ВидОбс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |    Подразделение,
	               |	НарядНаТОТО.ТС,
	               |	НарядНаТОТО.ТС.ГаражныйНомер ГарНом,
	               |	НарядНаТОТО.ТС.ГосударственныйНомер ГосНом,
	               |	НарядНаТОТО.ТС.ТипТС.Родитель РодТипТС,
	               |	НарядНаТОТО.ТС.ТипТС ТипТС,
	               |	Месяц(НарядНаТОТО.Начало) Мес,
	               |	Год(НарядНаТОТО.Начало)   Год,
	               |	День(НарядНаТОТО.Начало)  Дн,
	               |	1 Кол,
	               |	НарядНаТОТО.Начало
	               |ИЗ
	               |	Документ.НарядНаТО.ТО КАК НарядНаТОТО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатМестонахождениеТС.СрезПоследних(&Дт, ) КАК уатМестонахождениеТССрезПоследних
	               |		ПО НарядНаТОТО.ТС = уатМестонахождениеТССрезПоследних.ТС
	               |ГДЕ
	               |	НарядНаТОТО.Ссылка = &Ссылка
	               |	И НарядНаТОТО.ВидОбслуживания = &ВидОбслуживания";
				   Запрос.УстановитьПараметр("Ссылка",Ссылка);
				   Запрос.УстановитьПараметр("Дт",ссылка.Дата);
				   Запрос.УстановитьПараметр("ВидОбслуживания",ВидОбс);
				   
				   Тбл = Запрос.Выполнить().Выгрузить();
				   
	тбКол = Новый ТаблицаЗначений;
	тбКол.Колонки.Добавить("Рек");
	тбКол.Колонки.Добавить("пРек");
	тбКол.Колонки.Добавить("Дн");
	тбКол.Колонки.Добавить("Мес");
	тбКол.Колонки.Добавить("СтрМес");
	тбКол.Колонки.Добавить("КолОбласти");
	тбКол.Колонки.Добавить("КолОбласти2");
	
	Тбл.Сортировать("Начало");
	а = НачалоНедели(Тбл[0].Начало);
	КонДт = КонецНедели(Тбл[Тбл.Количество()-1].Начало);
	
	Пока а < КонДт Цикл
		
		прек = "к"+прав(Год(а),2)+"_"+Месяц(а)+"_"+День(а);
		
		тбСтр     = тбКол.Добавить();
		тбСтр.Рек = пРек;
		тбСтр.Дн  = День(а);
		тбСтр.Мес = Месяц(а);
		тбСтр.СтрМес = Формат(а,"ДФ=MMMM");
		
		а = а + 3600*24;
		
	КонеЦЦикла;
	
	
	СтрСвр = "Кол";
	Для каждого Стр из Тбл Цикл
		
		прек = "к"+прав(Стр.Год,2)+"_"+Стр.Мес+"_"+Стр.Дн;
		Если тбКол.Найти(пРек,"пРек")=Неопределено Тогда
			тбКол.Найти(пРек,"Рек").пРек = пРек;
			
			Тбл.Колонки.Добавить(пРек,Новый описаниеТипов("Число"));
			СтрСвр = СтрСвр +","+ пРек;
			
		КонецеСЛИ;
		
		Стр[пРек] = 1;
		
	КонецЦиклА;
	
	ТБл.Свернуть("Подразделение,РодТипТС,ТипТС,ГарНом,ТС,ГосНом",СтрСвр);
	ТБл.Сортировать("Подразделение,ГарНом");
	
	Возврат Тбл;
	
КонецФункции

Процедура Печать(ВидОбс) Экспорт
	
	Перем ТбКол,Стрсвр;
	
	
	Если Не уатОбщегоНазначенияТиповые.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	НадоДваДня = ВидОбс.НормоДней = 2;
	
	ОблПодр   = Новый ТабличныйДокумент;
	ОблСтрока = Новый ТабличныйДокумент;
	
	ТБл =ДанныеГр(тбКол,Стрсвр,ВидОбс);
	
	Таб = новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ГрафикТО_Документ";
	Макет = ПолучитьМакет("Макет1");
	
	СкомпоноватьМакеты(Таб,Макет,ОблПодр,ОблСтрока,тбКол,ВидОбс);	
	Таб.ПовторятьПриПечатиСтроки = Таб.Область(3,,4);
	
	тбПОдр = Тбл.Скопировать();
	тбПодр.Свернуть("Подразделение",СтрСвр);
	
	Для каждого стПодр из тбПодр Цикл
		
		облПОдр.Параметры.Заполнить(стПодр);
		Таб.Вывести(облПодр);
		Таб.НачатьГруппуСтрок();
		Ном = 0;
		
		Мас = Тбл.НайтиСтроки(Новый Структура("Подразделение",стПодр.Подразделение));
		Для каждого Эл из Мас Цикл
			ОблСтрока.Параметры.Заполнить(Эл);
			
			Ном = ном+1;
			ОблСтрока.Параметры.Ном = Ном;
			Таб.Вывести(Облстрока);
			
			ДЛя каждого Колонка из ТбКол Цикл
				Если Колонка.пРек = Неопределено Тогда Продолжить; КонецеСЛИ;
				Если Эл[Колонка.Рек]=0 ТОгда Продолжить; КонецесЛИ;
				Таб.Область(Таб.ВысотаТаблицы,Колонка.КолОбласти, Таб.ВысотаТаблицы,Колонка.КолОбласти).Узор   = ТипУзораТабличногоДокумента.Узор14;
				Если НадоДваДня Тогда
					Таб.Область(Таб.ВысотаТаблицы,Колонка.КолОбласти2,Таб.ВысотаТаблицы,Колонка.КолОбласти2).Узор  = ТипУзораТабличногоДокумента.Узор14;
				КонецеСЛИ;
			Конеццикла;
		КонецЦикла;
		
		Таб.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
	
	
	Таб.Показать();
	
КонецПроцедуры

Процедура ВставитьОбласть(облСтрока,ОблС,ШиринаТаблицы)
	
		облСтрока.ВставитьОбласть(ОблС,облСтрока.Область(1,Облстрока.ШиринаТаблицы+1,1,Облстрока.ШиринаТаблицы+ШиринаТаблицы),,Ложь);
	
КонецПроцедуры

Процедура ФорматОбласти(облИтог)
	
	Обл1 = облИтог.Область(1,1,1,1);
	
	//облИтог.Область(1,1,1,облИтог.ШиринаТаблицы).Обвести(Обл1.ГраницаСлева,Обл1.ГраницаСверху,Обл1.ГраницаСправа,Обл1.ГраницаСнизу);
	//облИтог.Область(1,1,1,облИтог.ШиринаТаблицы).Шрифт = Обл1.Шрифт;
	облИтог.Область(1,1,1,облИтог.ШиринаТаблицы).Цветфона = обл1.ЦветФона;
	
КонецПроцедуры

Процедура СкомпоноватьМакеты(Таб,Макет,ОблПодр,ОблСтрока,тбКол,ВидОбс)
	
	Состояние("Формирование макетов...");
	
	
	обл  = Макет.ПолучитьОбласть("Шапка|й1");
	ОблС = Макет.Область("Строка|й1");
	ОблП = Макет.Область("Подр|й1");
	
	обл.параметры.СтрПериод = "  "+Формат(Дата,"ДФ=dd.MM.yyyy");
	обл.параметры.ВидОбс = ВидОбс;
	Таб.Вывести(обл);
	
	облСтрока.ВставитьОбласть(ОблС,облСтрока.Область(1,1,1,Обл.ШиринаТаблицы),,Ложь);
	ОблПодр.ВставитьОбласть(ОблП,ОблПодр.Область(1,1,1,Обл.ШиринаТаблицы),,Ложь);
	
	ОблС  = Макет.Область("Строка|й2");
	ОблП  = Макет.Область("Подр|й2");
	
	ТекЛиния1 = новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	ТекЛиния2 = новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2);
	
	пМес = "";
	Ном=0;
	КолОбласти = 5;
	Для каждого Колонка из тбКол Цикл
		Ном = Ном+1;
		КолОбласти = КолОбласти+1;
		Колонка.КолОбласти = КолОбласти;
		Если Ном = 6 ТОгда
			Колонка.КолОбласти2 = КолОбласти+2;
		ИНаче
			Колонка.КолОбласти2 = КолОбласти+1;
		КонецесЛИ;
		
		Обл = Макет.ПолучитьОбласть("Шапка|й2");
		
		Обл.Параметры.Дн = Колонка.Дн;
		Если пМес <> Колонка.Стрмес Тогда
			пМес = Колонка.СтрМес;
			Обл.Область(3,1,3,1).Текст = пМес;
			Обл.Область(3,1,4,1).ГраницаСлева = ТекЛиния2;
			ОблС.ГраницаСлева = ТекЛиния2;
			ОблП.ГраницаСлева = ТекЛиния2;
		ИНАче
			ОблС.ГраницаСлева = ТекЛиния1;
			ОблП.ГраницаСлева = ТекЛиния1;
		КонецЕСЛИ;
		Таб.Присоединить(Обл);
		
		Если Ном=7 Тогда
			Ном=0;
			ОблС.ЦветФона = WebЦвета.СветлоСерый;
		ИначеЕсли Ном=1 Тогда  
			ОблС.ЦветФона = Новый Цвет;
		КонецЕСЛИ;
		
		
		//Для строки
		ВставитьОбласть(облСтрока,облС,Обл.ШиринаТаблицы);
		ширТаб = облстрока.ШиринаТаблицы;
		облСтрока.Область(1,ширТаб  ,1,ширТаб  ).Параметр = Колонка.Рек;
		
		//Для Подразделения
		ВставитьОбласть(облПодр,ОблП,Обл.ШиринаТаблицы);
		облПодр.Область(1,облПодр.ШиринаТаблицы  ,1,облПодр.ШиринаТаблицы  ).Параметр = Колонка.Рек;
		
	КонецЦикла;
	
		Обл = Макет.ПолучитьОбласть("Шапка|й3");
		ОблС = Макет.Область("Строка|й3");
		ОблП = Макет.Область("Подр|й3");
		Таб.Присоединить(Обл);
		
		ВставитьОбласть(облСтрока,облС,Обл.ШиринаТаблицы);
		ВставитьОбласть(облПодр,ОблП,Обл.ШиринаТаблицы);
		
	
	ФорматОбласти(облПодр);
				   
Конецпроцедуры
